tap "aljohri/-"
tap "aws/tap"
tap "fujiwara/tap"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
brew "amazon-ecs-cli"
brew "antigen"
brew "readline"
brew "numpy"
brew "apache-arrow"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bat"
brew "binutils"
brew "black"
brew "freetype"
brew "gettext"
brew "libffi"
brew "glib"
brew "cairo"
brew "cheat"
brew "colordiff"
brew "cookiecutter"
brew "coreutils"
brew "csvkit"
brew "direnv"
brew "docker-credential-helper-ecr"
brew "dos2unix"
brew "duti"
brew "dvc"
brew "libtool"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "findutils"
brew "openjdk"
brew "flyway"
brew "gh"
brew "gist"
brew "git"
brew "gnu-sed"
brew "gnu-time"
brew "libgpg-error"
brew "gnupg"
brew "go"
brew "python@3.8"
brew "gts"
brew "graphviz"
brew "htop"
brew "httpie"
brew "hub"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "mas"
brew "memtester"
brew "moreutils"
brew "most"
brew "nbdime"
brew "nmap"
brew "node"
brew "openjdk@8"
brew "p7zip"
brew "pandoc"
brew "parquet-tools"
brew "pidof"
brew "pipenv"
brew "pipx"
brew "postgresql", restart_service: true
brew "pre-commit"
brew "prettier"
brew "pssh"
brew "pup"
brew "python-yq"
brew "qt"
brew "r"
brew "reattach-to-user-namespace"
brew "renameutils"
brew "ripgrep"
brew "ripgrep-all"
brew "ruby"
brew "shellcheck"
brew "silicon"
brew "ssh-copy-id"
brew "telnet"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "aljohri/-/docx2pdf"
brew "aljohri/-/kar"
brew "aljohri/-/sshpass"
brew "aljohri/-/ssm"
brew "aws/tap/aws-sam-cli"
brew "fujiwara/tap/kinesis-tailf"
cask "1password-beta"
cask "1password-cli"
cask "airserver"
cask "alt-tab"
cask "balenaetcher"
cask "bartender"
cask "carbon-copy-cloner"
cask "charles"
cask "choosy"
cask "cyberduck"
cask "daisydisk"
cask "discord"
cask "docker"
cask "dropbox"
cask "duet"
cask "dupeguru"
cask "flash-npapi"
cask "flash-player"
cask "flash-ppapi"
cask "fluid"
cask "font-fira-code"
cask "font-meslo-for-powerline"
cask "font-meslolg-nerd-font"
cask "fsnotes"
cask "geekbench"
cask "geektool"
cask "gfxcardstatus"
cask "google-chrome-beta"
cask "google-chrome-canary"
cask "google-hangouts"
cask "handbrake"
cask "houseparty"
cask "hyperdock"
cask "iterm2"
cask "keepingyouawake"
cask "keybase"
cask "little-snitch"
cask "logitech-camera-settings"
cask "logitech-control-center"
cask "logitech-options"
cask "macdown"
cask "miro"
cask "monitorcontrol"
cask "mpv"
cask "notion"
cask "paragon-ntfs"
cask "parallels"
cask "pdf-expert"
cask "plex-media-server"
cask "popcorn-time"
cask "private-internet-access"
cask "provisionql"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "rectangle"
cask "rstudio"
cask "screens-connect"
cask "signal"
cask "skype"
cask "slack"
cask "soundsource"
cask "spotify"
cask "standard-notes"
cask "steam"
cask "sublime-text"
cask "tableplus"
cask "tabula"
cask "teamviewer"
cask "toggl"
cask "ubersicht"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "webtorrent"
cask "yt-music"
cask "zoom"
mas "GarageBand", id: 682658836
mas "Helium", id: 1054607607
mas "iMovie", id: 408981434
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Notability", id: 736189492
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Room Planner", id: 1451474641
mas "TickTick", id: 966085870
mas "Trello", id: 1278508951
mas "WhatsApp", id: 1147396723
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
