tap "aljohri/personal"
tap "aws/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "idleberg/dbxcli"
tap "wpmedia/perso-tools"
tap "mongodb/brew"
cask "adoptopenjdk8"
cask "osxfuse"
brew "mongodb/brew/mongodb-community-shell"
brew "antigen"
brew "readline"
brew "python"
brew "archey"
brew "arp-scan"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "asdf"
brew "gettext"
brew "libffi"
brew "glib"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bat"
brew "bazaar"
brew "binutils"
brew "bison"
brew "black"
brew "boot-clj"
brew "brightness"
brew "freetype"
brew "cheat"
brew "clojure"
brew "colordiff"
brew "cowsay"
brew "crunch"
brew "csvkit"
brew "datamash"
brew "dex2jar"
brew "ghostscript"
brew "djvu2pdf"
brew "dos2unix"
brew "duti"
brew "dvc"
brew "ec2-api-tools"
brew "elasticsearch", restart_service: true
brew "exa"
brew "expect"
brew "gnutls"
brew "ffmpeg"
brew "fish"
brew "flex"
brew "flyway"
brew "fortune"
brew "fzf"
brew "libxml2"
brew "qt"
brew "gist"
brew "git"
brew "gnu-sed"
brew "gnu-time"
brew "libgpg-error"
brew "libusb"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grep"
brew "gtk+"
brew "html2text"
brew "htop"
brew "httpie"
brew "hub"
brew "hydra"
brew "imagemagick"
brew "intltool"
brew "jq"
brew "jsonpp"
brew "kafka"
brew "leiningen"
brew "libarchive"
brew "libgit2"
brew "libglade"
brew "libiconv"
brew "libxslt"
brew "lighttpd"
brew "lzlib"
brew "mas"
brew "maven"
brew "memtester"
brew "mercurial"
brew "moreutils"
brew "most"
brew "mysql", restart_service: true
brew "ncdu"
brew "ncrack"
brew "nmap"
brew "node"
brew "nbdime"
brew "oath-toolkit"
brew "openconnect"
brew "p7zip"
brew "pandoc"
brew "parquet-tools"
brew "pidof"
brew "pipenv"
brew "pipx"
brew "postgresql", restart_service: true
brew "postgis"
brew "pre-commit"
brew "pssh"
brew "pup"
brew "pyenv"
brew "python-yq"
brew "python@2"
brew "qpdf"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "renameutils"
brew "ripgrep"
brew "ripgrep-all"
brew "ruby"
brew "sdl"
brew "shellcheck"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "sshfs"
brew "starship"
brew "subversion", link: false
brew "tcl-tk"
brew "tcpflow"
brew "telnet"
brew "texinfo"
brew "tig"
brew "tldr"
brew "tor", restart_service: true
brew "tree"
brew "watch"
brew "wget"
brew "ydiff"
brew "youtube-dl"
brew "zsh"
brew "aljohri/personal/openconnect-okta-helper"
brew "aljohri/personal/sshpass"
brew "aws/tap/aws-sam-cli"
brew "heroku/brew/heroku"
brew "wpmedia/perso-tools/clokta-utils"
brew "wpmedia/perso-tools/ec2"
brew "wpmedia/perso-tools/emr"
brew "wpmedia/perso-tools/nile"
brew "wpmedia/perso-tools/perso-apache-spark"
brew "wpmedia/perso-tools/ssm"
cask "1password-beta"
cask "1password-cli"
cask "airserver"
cask "android-file-transfer"
cask "android-platform-tools"
cask "balenaetcher"
cask "carbon-copy-cloner"
cask "charles"
cask "cyberduck"
cask "discord"
cask "djview"
cask "docker"
cask "flash-npapi"
cask "flash-player"
cask "flash-ppapi"
cask "font-fira-code"
cask "fsnotes"
cask "geekbench"
cask "google-chrome-canary"
cask "google-hangouts"
cask "handbrake"
cask "iterm2"
cask "keepingyouawake"
cask "keybase"
cask "lingon-x"
cask "little-snitch"
cask "logitech-options"
cask "macdown"
cask "mactex"
cask "microsoft-teams"
cask "monitorcontrol"
cask "mpv"
cask "paragon-ntfs"
cask "pdf-expert"
cask "private-internet-access"
cask "provisionql"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "r"
cask "rectangle"
cask "rstudio"
cask "screens-connect"
cask "skype"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "table-tool"
cask "tableplus"
cask "tabula"
cask "tad"
cask "teamviewer"
cask "textual"
cask "ticktick"
cask "transmission"
cask "transmit"
cask "unetbootin"
cask "virtualbox"
cask "visual-studio-code"
cask "webpquicklook"
cask "webtorrent"
cask "wireshark"
cask "yt-music"
cask "dropbox" unless File.directory?("/Applications/Dropbox.app")
cask "google-chrome-beta" unless File.directory?("/Applications/Google Chrome.app")
cask "slack" unless File.directory?("/Applications/Slack.app")
cask "vlc" unless File.directory?("/Applications/VLC.app")
mas "DaisyDisk", id: 411643860
mas "Gapplin", id: 768053424
mas "Leaf", id: 576338668
mas "Notability", id: 736189492
mas "Pocket", id: 568494494
mas "PomoDone App", id: 1096128050
mas "Trello", id: 1278508951
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
