# Get started faster
cask 'google-chrome-beta'
cask 'iterm2-nightly' # terminal emulator
cask 'flash' # flash player plugin (pkg installer)

cask 'firefoxdeveloperedition'

# Python Anaconda 3
# cask 'anaconda' unless File.directory?(ENV['HOME'] + '/anaconda3')
cask 'charles'
cask 'gitter'
cask 'skitch'
cask 'teamviewer'
cask 'textual'
cask 'colloquy'
cask 'balsamiq-mockups'

cask 'logitech-unifying' # for mouse + keyboard (pkg installer, requires input to close dialog)
cask 'logitech-options' # # to program mouse butons

cask 'sizeup' # snap windows by mouse
cask 'cinch' # control window placement via hotkeys
cask 'the-unarchiver' # better unarchiving tool
cask 'evernote' # note taker
cask 'insync' # sync google drive documents
cask 'dropbox' # sync files
cask 'skype' # video chat
cask 'google-hangouts' # also video chat (pkg installer)
cask 'slack' # team communication
cask 'spotify' # streaming music player
cask 'vlc' # video player
cask 'fluid'
cask 'flip4mac' # play windows media on mac (pkg installer)
cask 'transmission'
cask 'bartender'
cask 'calibre'
cask 'licecap' # gif creator

# cask 'osxfuse'
# cask 'sshfs'

# [Brew Cask] Non-essential Apps
# cask 'airserver'
# cask 'macdown' # markdown editor
# cask 'audacity' # audio recording
# cask 'ccleaner'
# cask 'paintbrush' # another ms paint
# cask 'mac-linux-usb-loader' # create mac bootable usb flash drives (and potentially windows as well if uefi?)
# cask 'unetbootin' # create windows bootable usb flash drives (and potentially mac as well if uefi?)

# [Brew Cask] Quick Look Plugins
# https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode' # syntax highlighting
cask 'qlstephen'
cask 'qlmarkdown' # markdown
cask 'quicklook-json' # json
# cask 'quicklook-csv' # csv (default csv render is better)
cask 'webpquicklook'
cask 'provisionql' # ipa files

# Misc
brew 'jack', restart_service: :changed

# Personal PVR
# cask 'plex-media-server'
# brew 'sickbeard', restart_service: :changed
# brew 'couchpotatoserver', restart_service: :changed
# brew 'headphones', restart_service: :changed

# -------------------------------------

# Development

# Command Line Tools
# brew 'coreutils'
# brew 'moreutils' # cool cmdline utilites like sponge
# brew 'homebrew/dupes/rsync'
# brew 'diffutils'
# brew 'findutils' '--with-default-names'
# brew 'homebrew/dupes/grep' '--with-default-names'
 # color plain diff output
brew 'memtester'
brew 'shellcheck'
brew 'watch'
brew 'md5sha1sum'
brew 'ssh-copy-id'
brew 'getxbook' # ebook downloader
brew 'ec2-api-tools'
brew 'cowsay'
brew 'fortune'
brew 'archey'
brew 'jsonpp'
brew 'htop-osx'
brew 'pidof'

# [Brew Cask] Development
cask 'pgadmin3'
cask 'psequel'
cask 'sqlitebrowser' # sqlite gui
cask 'virtualbox' # virtual os / emulators (pkg installer)
cask 'vagrant' # package virtual envs for development (pkg installer)
cask 'sequel-pro' # mysql gui
cask 'macfusion' # use sublime via ssh (sshfs)
cask 'arduino'
cask 'weka'
cask 'tabula'
cask 'gephi'
